# Project 3 - Part 3 (Core)
Rodrigo Arguello-Serrano

## Imports

In [1]:
#Import Modules
import pandas as pd
import numpy as np
import os, time, json

import tmdbsimple as tmdb 
from tqdm.notebook import tqdm_notebook

FOLDER = "Data/"
os.makedirs(FOLDER, exist_ok=True)
os.listdir(FOLDER)

from sqlalchemy.types import *
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists,create_database
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote

## Create MySQL Connection

In [2]:
with open('/Users/rodrigoarguelloserrano/.secret/mysql.json', 'r') as f:
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

In [3]:
# connection = f'mysql+pymysql://{username}:{password}@localhost/Chinook'
connection = f"mysql+pymysql://{login['username']}:{urlquote(login['password'])}@localhost/imdb"
engine = create_engine(connection)

In [4]:
## Check if database exists, if not, create it
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created!')

It exists!

## Loading data

In [5]:
data_2001 = pd.read_csv(f"{FOLDER}final_tmdb_data_2001.csv.gz")

In [6]:
data_2000 = pd.read_csv(f"{FOLDER}final_tmdb_data_2000.csv.gz")

In [7]:
tmdb_results_combined = pd.concat([data_2000,data_2001])

In [8]:
tmdb_results_combined.head(2)

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.5,22.0,NaN

## Normalizing Genres

### Getting List of Unique Genres

In [9]:
# Open saved file and preview again
basics = pd.read_csv(f"{FOLDER}title_basics.csv.gz", low_memory = False)
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

In [10]:
basics['genres_split'] = basics['genres'].str.split(',')
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama,[Drama]
...,...,...,...,...,...,...,...,...,...,...
85822,tt9914942,movie,Life Without Sara Amat,La vida sense la Sara Amat,0,2019.0,NaN,74,Drama,[Drama]
85823,tt9915872,movie,The Last White Witch,My Girlfriend is a Wizard,0,2019.0,NaN,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
85824,tt9916170,movie,The Rehearsal,O Ensaio,0,2019.0,NaN,51,Drama,[Drama]
85825,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
85826,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History","[Drama, History]"

In [11]:
exploded_genres = basics.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
85825,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Action
85825,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Adventure
85825,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Thriller
85826,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History",Drama
85826,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History",History

In [12]:
unique_genres = sorted(exploded_genres['genres_split'].unique())

### Create a new title_genres table

In [13]:
titile_genres = exploded_genres[['tconst', 'genres_split']].copy()
titile_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

### Create a genre mapper dictionary to replace string genres with integers

In [14]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [15]:
genre_id_map = dict(zip(unique_genres,range(len(unique_genres))))
genre_id_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

### Replace the string genres in title_genres with the new integer ids.

In [16]:
## make new integer genre_id and drop string genres
basics['genre_id'] = basics['genres_split'].replace(genre_map)
basics = basics.drop(columns='genres_split')

### Convert the genre map dictionary into a dataframe.

In [17]:
genre_lookup = pd.DataFrame({'Genre_Name':genre_id_map.keys(), 
                             'Genre_ID':genre_id_map.values()})

In [18]:
genre_lookup.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

## Saving the MySQL tables with tconst as the primary key.

- In order to normalize genres, we will need to:

>Convert the single string of genres from title basics into 2 new tables.

- title_genres: with the columns:
    - tconst
    - genre_id

- genres
    - genre_id
    - genre_name

### ```titile_genres``` prepping

In [19]:
# Renaming columns for titile_genres
titile_genres.rename(columns={'genres_split': 'genre_id'}, inplace=True)
titile_genres.head()

      tconst genre_id
0  tt0035423   Comedy
0  tt0035423  Fantasy
0  tt0035423  Romance
1  tt0062336    Drama
2  tt0069049    Drama

In [20]:
key_len = titile_genres['tconst'].fillna('').map(len).max()
genre_id_len = titile_genres['genre_id'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
title_genres_schema = {
    "tconst": String(key_len+1), 
    "genre_id": Text(genre_id_len+1),}

# Save to sql with dtype and index=False
titile_genres.to_sql('title_genres',engine,dtype=title_genres_schema,if_exists='replace',index=False)

160317

### genres prepping

In [21]:
# Renaming columns for genres
genre_lookup.rename(columns={'Genre_Name':'genre_name','Genre_ID':'genre_id'},inplace=True)
genres = genre_lookup.iloc[:,[1,0]].copy()
genres.head()

   genre_id genre_name
0         0     Action
1         1      Adult
2         2  Adventure
3         3  Animation
4         4  Biography

In [22]:
genre_mane_len = genres['genre_name'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
title_genres_schema = {
    "genre_id": Integer(), 
    "genre_name": Text(genre_mane_len+1),}

# Save to sql with dtype and index=False
genres.to_sql('genres',engine,dtype=title_genres_schema,if_exists='replace',index=False)

26

 ### ```title_basics``` prepping (basics)
 - For the title basics table, I am dropping the following columns:
    - "original_title" (we will use the primary title column instead)
    - "isAdult" ("Adult" will show up in the genres so this is redundant information).
    - "titleType" (every row will be a movie).
    - "genres" and other variants of genre (genre is now represented in the 2 new tables described above.

In [23]:
# Checking Indexes
basics.columns

Index(['tconst', 'titleType', 'primaryTitle', 'originalTitle', 'isAdult',
       'startYear', 'endYear', 'runtimeMinutes', 'genres', 'genre_id'],
      dtype='object')

In [24]:
title_basics = basics[['tconst','primaryTitle','startYear','runtimeMinutes']]
title_basics.head()

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0096056,Crime and Punishment,2002.0,126

In [25]:
## Calculate max string lengths for object columns
key_len = title_basics['tconst'].fillna('').map(len).max()
title_len = title_basics['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
title_basics_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'runtimeMinutes':Integer()}

# Save to sql with dtype and index=False
title_basics.to_sql('title_basics',engine,dtype=title_basics_schema,if_exists='replace',index=False)

85827

#### Run the query to ADD PRIMARY KEY

In [26]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

### ttmdb_api prepping

In [28]:
tmdb_api = tmdb_results_combined[['imdb_id','revenue','budget','certification']].copy()
tmdb_api.head()

     imdb_id     revenue      budget certification
0          0         NaN         NaN           NaN
1  tt0113026         0.0  10000000.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694  12854953.0    150000.0            PG

In [29]:
tmdb_api = tmdb_api[tmdb_api['imdb_id']!='0']
tmdb_api

        imdb_id     revenue      budget certification
1     tt0113026         0.0  10000000.0           NaN
2     tt0113092         0.0         0.0           NaN
3     tt0116391         0.0         0.0           NaN
4     tt0118694  12854953.0    150000.0            PG
5     tt0118852         0.0         0.0             R
...         ...         ...         ...           ...
1304  tt7797790         0.0         0.0           NaN
1305  tt8665056         0.0         0.0           NaN
1306  tt8795764         0.0         0.0            NR
1307  tt9071078         0.0         0.0           NaN
1308  tt0317657         0.0         0.0           NaN

[2534 rows x 4 columns]

In [30]:
## Calculate max string lengths for object columns
key_len = tmdb_api['imdb_id'].fillna('').map(len).max()
cert_len = tmdb_api['certification'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
tmdb_api_schema = {
    "imdb_id": String(key_len+1), 
    "certification": Text(cert_len+1),
    'budget':Float(),
    'revenue':Integer()}

# Save to sql with dtype and index=False
tmdb_api.to_sql('ttmdb_api',engine,dtype=tmdb_api_schema,if_exists='replace',index=False)

2534

#### Run the query to ADD PRIMARY KEY

In [31]:
engine.execute('ALTER TABLE ttmdb_api ADD PRIMARY KEY (`imdb_id`);')

### ratings prepping
- Title Ratings
    - Movie ID (tconst)
    - Average Movie Rating
    - Number of Votes

In [33]:
# Open saved file and preview again
ratings = pd.read_csv(f"{FOLDER}title_ratings.csv.gz",compression='gzip')
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1959
1  tt0000002            5.8       263
2  tt0000005            6.2      2596
3  tt0000006            5.1       177
4  tt0000007            5.4       814

In [34]:
## Calculate max string lengths for object columns
key_len = ratings['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
ratings_schema = {
    "tconst": String(key_len+1), 
    'averageRating':Float(),
    'numVotes':Integer()}

# Save to sql with dtype and index=False
ratings.to_sql('ratings',engine,dtype=ratings_schema,if_exists='replace',index=False)

491527

#### Run the query to ADD PRIMARY KEY

In [35]:
engine.execute('ALTER TABLE ratings ADD PRIMARY KEY (`tconst`);')